content/main/20210929115829-org_mode.md
+++
title = "Org-mode"
author = ["System Administrator"]
draft = false
+++

see [org-card](https://orgmode.org/worg/orgcard.html)


## Task management {#task-management}


### Agenda {#agenda}

_Agenda_ is a functionality of **Org-mode** focusing on <span class="underline">Task Management</span>.
_Agenda_ provides a view to see all the tasks in a <span class="underline">Daily/Weekly Base</span>


#### Add to Agenda {#add-to-agenda}

Add Tasks to agenda by:

1.  Add TODO to the front of heading
2.  **Schedule** by <span class="underline">C-c C-s</span>- or **Deadline** by <span class="underline">C-c C-d</span>

<!--list-separator-->

-  `TODO` States

    <!--list-separator-->

    -  Next

        TODO in (TODO NEXT | DONE)
        `Next` means the next task to do.

        -   Marked by hand from all TODOS(access by agenda command)
        -   DO only the NEXT tasks.

        embed the NEXT principle into the machines.

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Set a machine with the NEXT tasks


#### Agenda view {#agenda-view}

Called by <span class="underline">M-x org-agenda(bind to C-c a)</span>

<!--list-separator-->

-  Basic Use

    As opened, <span class="underline">Week View</span> will be shown. Upon selecting weekdays, the day will be focused.

<!--list-separator-->

-  Dashboard

    into agenda view, hit <span class="underline">d</span>.


#### Agenda files {#agenda-files}

Agenda access files marked in the list variable <span class="underline">org-agenda-files</span>
should be kept in [init-org.el](~/.emacs.d/lisp/init-org.el)


### Tags {#tags}

Use <span class="underline">C-c C-q</span> to quily insert Tags(C-c C-c on headings)
Use <span class="underline">M-x Counsel-org-tag</span> to search for tags


#### Contents of tags {#contents-of-tags}

-   Place
    -   @errand
    -   @home
    -   @work
-   Type
    -   agenda
        for `works, time, schedule, .etc`
        Personal Things, like Meeting information, Coursework information
    -   planning
        a task to make plan about something
    -   batch
        a task to do something in batch
    -   note
        a note about non-personal things, like Math or Code or Principle
    -   idea
        a `programming idea` or a `drawing idea`...
-   Machine specific
    -   machine
        a bunch of procedurals constructed and executed with awareness to cirtain principles.
    -   principle
        see [principle]({{< relref "20211005121901-principle.md" >}})


## Org-capture {#org-capture}

org-capture, bind by `C-c c`, capture random thought and throw them into buckets.


### org-capture templates {#org-capture-templates}

specified in [&lt;init-org.el&gt;](~/.emacs.d/lisp/init-org.el).
syntax:[ org-capture syntax sheet](https://xuchengpeng.com/hugo-blog/2018/07/20/powerful-org-capture/)


### elisp inside the template {#elisp-inside-the-template}

I can call function(that I wrote) in the template, to fill in information. that's pretty cool, if I'm doing something like making word card.


## Time {#time}


### Timer {#timer}


#### Start {#start}

C-c C-x 0 : start timer
C-c C-x ; : start countdown timer


#### Use {#use}

All under C-c C-x prefix

-   . insert the timer time
-   - insert a timer time list item
-   M-RET on the list item create anotehr list item follow the format


#### Stop/pause {#stop-pause}

-   , pause
-   _ stop


### Clock-in, Clock-out {#clock-in-clock-out}

-   C-c-x-i
-   C-c-x-o
-   C-c-x-q :cancel
-   c-c-x-j :jump to
-   C-c-x-x :in-last
-   C-c-x-d :display the total time of subtree


## Document Writing {#document-writing}


### THREAD Figure how to write documnet with org-mode <span class="tag"><span class="agenda">agenda</span></span> {#thread-figure-how-to-write-documnet-with-org-mode}


#### <span class="org-todo todo TODO">TODO</span> Find way to organize refs {#find-way-to-organize-refs}

The capture and orgnize in database is well done by _Zotero_.
But how to take note of them, and how to use them in org-mode doc writing is still under investigation.


### Jupyter integration {#jupyter-integration}


#### sessions {#sessions}

different file often are onto different projects, so to signify the them from each, add `sessionname` after the `:session` option

```python
data = [1,2,3,4]
```

```text
# Out[1]:
```

```python
data = [5,6,7,8]
```

```text
# Out[1]:
```

```python
data
```

```text
# Out[2]:
[1, 2, 3, 4]
```

```python
data
```

```text
# Out[2]:
[5, 6, 7, 8]
```

<a id="org-example-block--the processes"></a>
```text
kernel-default               55849       run       *ob-ipython-kernel-default*                         /dev/ttys002            Main            jupyter console --simple-prompt -f emacs-default.json
kernel-example_session               59617       run       *ob-ipython-kernel-example_session*                         /dev/ttys007            Main            jupyter console --simple-prompt -f emacs-example_session.json
kernel-example_session01               59603       run       *ob-ipython-kernel-example_session01*                         /dev/ttys006            Main            jupyter console --simple-prompt -f emacs-example_session01.json
kernel-example_session02               59635       run       *ob-ipython-kernel-example_session02*                         /dev/ttys008            Main            jupyter console --simple-prompt -f emacs-example_session02.json
kernel-example_session03               59660       run       *ob-ipython-kernel-example_session03*                         /dev/ttys009            Main            jupyter console --simple-prompt -f emacs-example_session03.json
kernel-example_session04               59672       run       *ob-ipython-kernel-example_session04*                         /dev/ttys010            Main            jupyter console --simple-prompt -f emacs-example_session04.json
kernel-session01               59538       run       *ob-ipython-kernel-session01*                         /dev/ttys004            Main            jupyter console --simple-prompt -f emacs-session01.json
kernel-session02               59566       run       *ob-ipython-kernel-session02*                         /dev/ttys005            Ma
```


#### Display images {#display-images}

standard output are like

```text
# Out[3]:
[1]
```

with the `:` in the front, which org-mode doesn't read to show inline-image. add `:results raw drawer` in options to put it in a drawer, and getting rid of the `:` at the same time.


### HTML Document/Website {#html-document-website}


#### Style themes {#style-themes}

[https://github.com/fniessen/org-html-themes/](https://github.com/fniessen/org-html-themes/) offered 2 good themes, `bigblow` and `readtheorg`
use: put

to the front of the file.


### ref {#ref}


#### org-ref {#org-ref}

<!--list-separator-->

-  errors

    <!--list-separator-->

    -  couldn't find entry

        `Warning (:warning): Bibtex-completion couldn't find entry with key "yoshimuraProductionMonocyteChemoattractant2017". Disable showing Disable logging`
        reported due to absenteeism of the variable `bibtex-files`. set it to be the same as the the included .bib in the org document, or have it holding all .bib libraries I have on the computerb, in the init.el.


## Snippets <span class="tag"><span class="drill">drill</span></span> {#snippets}


### Usable {#usable}

-   Author


#### latex/html marks/doc meta {#latex-html-marks-doc-meta}

-   &lt;c :center block
-   &lt;da :date
-   &lt;em :email
-   desc :description
-   &lt;e :example
-   fig\_ :latex figure


#### Babel {#babel}

-   elisp\_ :elisp block that tangle


#### Other {#other}

-   &lt;im
-   img\_ :html image


### Don't understand {#don-t-understand}

-   dot\_
-   emb\_
-   entry\_
-   &lt;ex :export
-   &lt;ht
-   &lt;i :include


## org-drill {#org-drill}

[org-drill](https://gitlab.com/phillord/org-drill) is a package for spaced repetition
it doesn't read headings with more than 4 hierachies inside.


### Using <span class="tag"><span class="drill">drill</span></span> {#using}


#### set question {#set-question}

topics with tag matching value of `org-drill-question-tag`, by default `drill`, will be treated as drill material

<!--list-separator-->

-  types

    -   cloze deletion: [text]
    -   cloze text hint: [text || hint]

    <!--list-separator-->

    -  2-sided cards <span class="tag"><span class="drill">drill</span></span>

        `DRILL-CARD-TYPE` = `twosided`